% отношение мощности сигнала к мощности шума
q = 5;

% плотность вероятности модульного значения корреляционного интеграла в случае наличия сигнала
signal_pdf = @(U, q) U .* besseli(0, q .* U) .* exp(-0.5*(q^2 + U.^2));

% количество слагаемых (импульсов)
M = 5;
% параметр B
B = M * q^2 / 2;

% плотность вероятности суммы квадратов при наличии шума
noise_sum_pdf = @(U, B) U.^(M-1) ./ ( 2^M * factorial(M-1) ) .* exp( -U/2 );
% плотность вероятности суммы квадратов при наличии сигнала и шума
signal_sum_pdf = @(U, B, M) 1/2 * ( U/(2*B) ).^((M-1)/2) .* exp(-(B + U/2)) .* besseli( M-1, (2*B*U).^0.5 );

% пороговое значение
U_t = 40;

h = M^0.5 * ( 1/q + q );
% приближение плотности вероятности суммы квадратов при наличии сигнала и шума
% переход к новой случайной величине
%approximate_pdf = @(y, B, M, q, h) exp( - B - (y+h).^2/2 ) * (2*B)^0.5 .* (1 + (y+h-(2*B)^0.5)/(2*B)^0.5 ).^M .* besseli(M-1, (2*B)^0.5*(y+h));
% замена степени
%approximate_pdf = @(y, B, M, q, h) exp( - B - (y+h).^2/2 ) * (2*B)^0.5 .* exp( (y+h-(2*B)^0.5)/(2*B)^0.5 * M ) .* besseli(M-1, (2*B)^0.5*(y+h));
% замена функции Бесселя
%approximate_pdf = @(y, B, M, q, h) exp( - B - (y+h).^2/2 ) * (2*B)^0.5 .* exp( (y+h-(2*B)^0.5)/(2*B)^0.5 * M ) .* 1./(2*pi*(2*B)^0.5*(y+h)).^0.5 .* exp((2*B)^0.5*(y+h));
% объединение показателей
%approximate_pdf = @(y, B, M, q, h) (2*B)^0.5 ./ (2*pi*(2*B)^0.5*(y+h)).^0.5 .* exp( - B - (y+h).^2/2 + (y+h-(2*B)^0.5)/(2*B)^0.5 * M + (2*B)^0.5*(y+h));
% преобразование первого множителя
%approximate_pdf = @(y, B, M, q, h) ((2*B)^0.5 ./ (2*pi*(y+h))).^0.5 .* exp( - B - (y+h).^2/2 + (y+h-(2*B)^0.5)/(2*B)^0.5 * M + (2*B)^0.5*(y+h));
% преобразование показателя
approximate_pdf = @(y, B, M, q, h) ((2*B)^0.5 ./ (2*pi*(y+h))).^0.5 .* exp( - y.^2/2 - M/(2*q^2) );

% график плотности модульного значения корреляционного интеграла в случае наличии сигнала
figure
u = 0:0.1:10;
plot( u, signal_pdf(u, q) );

% графики плотностей суммы квадратов при наличии только шума и смеси шума и сигнала
u = 0:1:2*(M * q^2);
figure
hold on
plot( u, noise_sum_pdf(u, B) );
plot( u, signal_sum_pdf(u, B, M) );
hold off

% вероятность правильного обнаружения
D = 1 - integral( @(u) signal_sum_pdf( u, B, M ), 0, U_t, 'AbsTol', 10^(-15) );
% вероятность ложного обнаружения
F = 1 - integral( @(u) noise_sum_pdf( u, B ), 0, U_t, 'AbsTol', 10^(-15) );

fprintf( 'True detection:\t\t%g\n', D );
fprintf( 'False detection:\t%g\n', F );

figure
y = -h:0.1:h;
plot( y, approximate_pdf(y, B, M, q, h) );
integral( @(y) approximate_pdf( y, B, M, q, h ), -h, h, 'AbsTol', 10^(-15) )

%plot(u, besseli(M-1, u) - 1./(2*pi*u)^0.5 * exp(u));