% коэффициент усиления для излучателя с четырьмя каналами
% парциальная диаграмма направленности 1-го канала
F1 = @(a, e) [ 0.1*exp(1i*pi/6) * cos(e) ; 0.2*exp(1i*pi/3) * sin(a) ];
F2 = @(a, e) [ 0.3*exp(1i*5*pi/4) * cos(e) ; 0.1*exp(-1i*pi/10) * sin(a) ];

% вычисляем матрицу Q
Q = zeros(2, 2);
% вычисляем КПД 1-го канала
Q(1,1) = integral2(@(a, e) c_product(F1, F1, a, e), 0, 2*pi, -pi/2, pi/2 );
% вычисляем коэффициент пересечения диаграмм
Q(1,2) = integral2(@(a, e) c_product(F1, F2, a, e), 0, 2*pi, -pi/2, pi/2 );
Q(2,1) = Q(1,2)';
% вычисляем КПД 2-го канала
Q(2,2) = integral2(@(a, e) c_product(F2, F2, a, e), 0, 2*pi, -pi/2, pi/2 );

R_12 = Q(1,2)/(Q(1,1)^0.5 * Q(2,2)^0.5);
% вычисляем ограничение
bound = 1/(1+abs(R_12));